/**
 * @param {number[]} count
 * @return {number[]}
 */
var sampleStats = function (count) {
    let result = []

    let min, max, avg, mid, most
    let sum = 0, counter = 0, mostCounter = 0
    for (let i = 0; i <= 255; i++) {
        if (min === undefined && count[i] > 0) {
            min = i
        }
        if (count[i] > 0) {
            max = i
        }
        sum = sum + i * count[i]
        counter += count[i]

        if (mostCounter < count[i]) {
            most = i
            mostCounter = count[i]
        }
    }


    for (let i = 0, pos = 0; i <= 255; i++) {
        pos += count[i]
        if (counter % 2 !== 0) {
            if (pos >= counter / 2) {
                mid = i
                break
            }
        } else { // 中间两个数的平均数
            if (pos === counter / 2) {
                for (let j = i + 1; j <= 255; j++) {
                    if (count[j] > 0) {
                        mid = (i + j) / 2
                        break
                    }
                }
                break
            }else if (pos  > counter / 2){
                mid = i
                break
            }
        }
    }

    avg = sum / counter

    for (let i = 255; i >= 0; i--) {
        if (count[i] > 0) {
            result.push(count[i])
        }
    }

    return [min, max, avg, mid, most]
};

count = [264, 912, 1416, 1903, 2515, 3080, 3598, 4099, 4757, 5270, 5748, 6451, 7074, 7367, 7847, 8653, 9318, 9601, 10481, 10787, 11563, 11869, 12278, 12939, 13737, 13909, 14621, 15264, 15833, 16562, 17135, 17491, 17982, 18731, 19127, 19579, 20524, 20941, 21347, 21800, 22342, 21567, 21063, 20683, 20204, 19818, 19351, 18971, 18496, 17974, 17677, 17034, 16701, 16223, 15671, 15167, 14718, 14552, 14061, 13448, 13199, 12539, 12265, 11912, 10931, 10947, 10516, 10177, 9582, 9102, 8699, 8091, 7864, 7330, 6915, 6492, 6013, 5513, 5140, 4701, 4111, 3725, 3321, 2947, 2357, 1988, 1535, 1124, 664, 206, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

let d = sampleStats(count)
console.log(d)
